# 第七章   数据清洗和准备

In [ ]:
pandas用浮点值NaN（not a number）表示缺失值

In [2]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan,
'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

python内置的None值在对象数组中也可以作为NA：

In [6]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

dropna 根据各标签的值中是否存在缺失数据对轴标签进行过滤，可以通过阀值调节对缺失值的容忍度
fillna 用指定或插值方法如ffill或bfill填充缺失数据
isnull 返回一个含有布尔值的对象，这些布尔值表示哪些值是缺失值/NA，该对象的类型与源类型一样
notnull isnull的否定式

滤除缺失数据

In [8]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])

In [9]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

DataFrame对象中，dropna默认丢弃任何含有缺失值的行：

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned = data.dropna()

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

传入how = ‘all’将只丢弃全为NA的那些行：

In [18]:
data.dropna(how= 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data[4] = NA

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis = 1,how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

滤除缺失数据时，如果想保留一部分数据

In [24]:
df = pd.DataFrame(np.random.randn(7,3))

In [25]:
df

          0         1         2
0  0.029996 -1.304522  0.236719
1  1.209736  0.199937 -0.354498
2 -0.099504  0.440217  0.780373
3  1.354351  1.001929 -1.040218
4  1.893033  1.251701 -0.534430
5  0.925453  0.736553  0.618491
6 -0.788745  0.741782 -0.106898

In [26]:
df.iloc[:4,1] = NA

In [27]:
df

          0         1         2
0  0.029996       NaN  0.236719
1  1.209736       NaN -0.354498
2 -0.099504       NaN  0.780373
3  1.354351       NaN -1.040218
4  1.893033  1.251701 -0.534430
5  0.925453  0.736553  0.618491
6 -0.788745  0.741782 -0.106898

In [29]:
df.iloc[:2,2] = NA

In [30]:
df

          0         1         2
0  0.029996       NaN       NaN
1  1.209736       NaN       NaN
2 -0.099504       NaN  0.780373
3  1.354351       NaN -1.040218
4  1.893033  1.251701 -0.534430
5  0.925453  0.736553  0.618491
6 -0.788745  0.741782 -0.106898

In [31]:
df.dropna()

          0         1         2
4  1.893033  1.251701 -0.534430
5  0.925453  0.736553  0.618491
6 -0.788745  0.741782 -0.106898

In [37]:
df.dropna(thresh = 2) #至少保留2个非NA的行

          0         1         2
2 -0.099504       NaN  0.780373
3  1.354351       NaN -1.040218
4  1.893033  1.251701 -0.534430
5  0.925453  0.736553  0.618491
6 -0.788745  0.741782 -0.106898

填充缺失数据

滤除缺失数据有可能会丢弃跟它有关的其他数据，可以通过其他方式填补
缺失值，大多数情况下，fillna方法是最主要的函数，通过一个常数
函数fillna就会将缺失值替换为那个常数值：

In [38]:
df

          0         1         2
0  0.029996       NaN       NaN
1  1.209736       NaN       NaN
2 -0.099504       NaN  0.780373
3  1.354351       NaN -1.040218
4  1.893033  1.251701 -0.534430
5  0.925453  0.736553  0.618491
6 -0.788745  0.741782 -0.106898

In [39]:
df.fillna(0)

          0         1         2
0  0.029996  0.000000  0.000000
1  1.209736  0.000000  0.000000
2 -0.099504  0.000000  0.780373
3  1.354351  0.000000 -1.040218
4  1.893033  1.251701 -0.534430
5  0.925453  0.736553  0.618491
6 -0.788745  0.741782 -0.106898

通过一个字典调用fillna，就可以实现对不同的列填充不同的值：

In [43]:
df.fillna({1:{0:0.5},2:{1:0}})

          0         1         2
0  0.029996  0.500000       NaN
1  1.209736       NaN  0.000000
2 -0.099504       NaN  0.780373
3  1.354351       NaN -1.040218
4  1.893033  1.251701 -0.534430
5  0.925453  0.736553  0.618491
6 -0.788745  0.741782 -0.106898

In [44]:
df.fillna({1:0,2:0})

          0         1         2
0  0.029996  0.000000  0.000000
1  1.209736  0.000000  0.000000
2 -0.099504  0.000000  0.780373
3  1.354351  0.000000 -1.040218
4  1.893033  1.251701 -0.534430
5  0.925453  0.736553  0.618491
6 -0.788745  0.741782 -0.106898

In [45]:
df = pd.DataFrame(np.random.randn(6,3))

In [46]:
df

          0         1         2
0  0.408158 -0.411799 -0.111181
1  0.087871  0.079253  0.699807
2  1.333766  1.025633 -0.995633
3 -0.037168  1.092847 -0.039111
4  0.201952 -0.550113  0.520979
5 -0.140862 -1.122428  0.417589

In [49]:
df.iloc[2:,1] = NA

In [50]:
df

          0         1         2
0  0.408158 -0.411799 -0.111181
1  0.087871  0.079253  0.699807
2  1.333766       NaN -0.995633
3 -0.037168       NaN -0.039111
4  0.201952       NaN  0.520979
5 -0.140862       NaN  0.417589

In [51]:
df.iloc[4:,2] = NA

In [52]:
df

          0         1         2
0  0.408158 -0.411799 -0.111181
1  0.087871  0.079253  0.699807
2  1.333766       NaN -0.995633
3 -0.037168       NaN -0.039111
4  0.201952       NaN       NaN
5 -0.140862       NaN       NaN

In [53]:
df.fillna(method = 'ffill')

          0         1         2
0  0.408158 -0.411799 -0.111181
1  0.087871  0.079253  0.699807
2  1.333766  0.079253 -0.995633
3 -0.037168  0.079253 -0.039111
4  0.201952  0.079253 -0.039111
5 -0.140862  0.079253 -0.039111

In [55]:
df.fillna(method = 'ffill',limit = 1)

          0         1         2
0  0.408158 -0.411799 -0.111181
1  0.087871  0.079253  0.699807
2  1.333766  0.079253 -0.995633
3 -0.037168       NaN -0.039111
4  0.201952       NaN -0.039111
5 -0.140862       NaN       NaN

In [59]:
data = pd.Series([1.,NA,3.5,NA,7])

In [60]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [57]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

axis 待填充的轴，默认axia = 0
inplace 修改调用者对象而不产生副本
limit 对于向前和向后填充，可以连续填充的最大数量

数据转换

移除重复数据

In [61]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                      'k2': [1, 1, 2, 3, 3, 4, 4]})

In [62]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

DataFrame的duplicated方法返回一个布尔型Series，表示各行是否
是重复行

In [63]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [64]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [65]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [66]:
data['V1'] = range(7)

In [67]:
data

    k1  k2  V1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [71]:
data.drop_duplicates(['k1'])

    k1  k2  V1
0  one   1   0
1  two   1   1

In [72]:
data.drop_duplicates(['k1','k2'],keep = 'last')

    k1  k2  V1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [82]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork',
'bacon','Pastrami', 'corned beef','Bacon',
         'pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5,6]})

In [83]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [84]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [85]:
lowercased = data['food'].str.lower()

In [86]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [87]:
data['animal'] = lowercased.map(meat_to_animal)

In [88]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [97]:
data['food'].map(lambda x : meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [90]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [98]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [99]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [100]:
import numpy as np

In [101]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [102]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [103]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [104]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [105]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                        index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [106]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [114]:
transform = lambda x : x[:4].upper()

In [115]:
transform

In [116]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [117]:
data.index = data.index.map(transform)

In [118]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [120]:
#data.index.str.title()

Index(['Ohio', 'Colo', 'New '], dtype='object')

In [121]:
data.rename(inde = str.title,columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [123]:
data.rename(index = {'OHIO':'INDIANA'},columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [124]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [125]:
data.rename(index={'OHIO':'INDIANA'},
           inplace = True)

In [126]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [127]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [128]:
bins = [18,25,35,60,100]

In [129]:
cats = pd.cut(ages,bins)

In [130]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [131]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [132]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [133]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [134]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged',
'Senior']

In [135]:
pd.cut(ages,bins,labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [136]:
data = np.random.rand(20)

In [137]:
data

array([0.44634997, 0.70868745, 0.77755757, 0.54321816, 0.76202214,
       0.47068042, 0.45564287, 0.13162388, 0.34283669, 0.74252986,
       0.39685016, 0.42682702, 0.96204793, 0.05456815, 0.61490122,
       0.00924779, 0.5750571 , 0.68254336, 0.46598503, 0.11505575])

In [157]:
a = pd.cut(data,4,precision = 2)

In [158]:
pd.value_counts(a)

(-1.55, 0.066]    454
(0.066, 1.69]     447
(-3.18, -1.55]     55
(1.69, 3.31]       44
dtype: int64

In [147]:
data = np.random.randn(1000)

In [148]:
cats = pd.qcut(data,4)

In [149]:
cats

[(0.0387, 0.703], (0.703, 3.306], (0.0387, 0.703], (-0.618, 0.0387], (0.0387, 0.703], ..., (0.703, 3.306], (0.703, 3.306], (-3.1759999999999997, -0.618], (-0.618, 0.0387], (-3.1759999999999997, -0.618]]
Length: 1000
Categories (4, interval[float64]): [(-3.1759999999999997, -0.618] < (-0.618, 0.0387] < (0.0387, 0.703] < (0.703, 3.306]]

In [150]:
pd.value_counts(cats)

(0.703, 3.306]                   250
(0.0387, 0.703]                  250
(-0.618, 0.0387]                 250
(-3.1759999999999997, -0.618]    250
dtype: int64

In [159]:
data = pd.DataFrame(np.random.randn(1000,4))

In [160]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003630     0.067507     0.032261    -0.021429
std       1.022605     1.012650     1.024995     1.017120
min      -3.098950    -3.135489    -3.030376    -3.314176
25%      -0.701840    -0.610489    -0.709521    -0.718017
50%      -0.014887     0.059283    -0.000910    -0.049827
75%       0.700919     0.745783     0.718221     0.633401
max       3.173325     3.310343     3.063321     2.965038

In [161]:
col = data[2]

In [163]:
col[np.abs(col) > 3]

125   -3.030376
168    3.063321
544    3.025032
703    3.039938
Name: 2, dtype: float64

In [170]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
24   1.528179  0.589591  0.401144 -3.314176
125  0.751264 -0.486832 -3.030376 -1.408067
168 -0.925631  0.496119  3.063321  0.444505
226  0.713416  3.276598  0.625677  1.502618
254  3.112537 -1.263216  1.604263  1.213025
335 -0.246900 -3.135489 -0.039172 -0.215610
495 -0.645282 -0.282411  1.524321 -3.257940
507  0.097993  3.130881 -0.656162  0.498385
519  3.173325  0.049361  0.424520 -0.633453
543 -0.626036  3.310343 -0.348713  0.307816
544  0.115016  0.457844  3.025032 -0.354934
703  1.107571  0.454082  3.039938 -0.060872
780 -3.098950  2.556443  0.732648 -2.218598

In [171]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [172]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003817     0.066925     0.032163    -0.020857
std       1.021448     1.010052     1.024530     1.015360
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.701840    -0.610489    -0.709521    -0.718017
50%      -0.014887     0.059283    -0.000910    -0.049827
75%       0.700919     0.745783     0.718221     0.633401
max       3.000000     3.000000     3.000000     2.965038

In [173]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1 -1.0 -1.0 -1.0 -1.0
2 -1.0  1.0  1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

In [177]:
data[(np.abs(data) == 3).any(1)]

            0         1         2         3
24   1.528179  0.589591  0.401144 -3.000000
125  0.751264 -0.486832 -3.000000 -1.408067
168 -0.925631  0.496119  3.000000  0.444505
226  0.713416  3.000000  0.625677  1.502618
254  3.000000 -1.263216  1.604263  1.213025
335 -0.246900 -3.000000 -0.039172 -0.215610
495 -0.645282 -0.282411  1.524321 -3.000000
507  0.097993  3.000000 -0.656162  0.498385
519  3.000000  0.049361  0.424520 -0.633453
543 -0.626036  3.000000 -0.348713  0.307816
544  0.115016  0.457844  3.000000 -0.354934
703  1.107571  0.454082  3.000000 -0.060872
780 -3.000000  2.556443  0.732648 -2.218598

In [178]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [181]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [209]:
sampler = np.random.permutation(len(df))

In [210]:
sampler

array([1, 2, 0, 4, 3])

In [211]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15

In [213]:
df.sample(n= 3)

   0  1   2   3
2  8  9  10  11
1  4  5   6   7
0  0  1   2   3

In [214]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
   .....:                    'data1': range(6)})

In [215]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [216]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [217]:
dummies = pd.get_dummies(df['key'],prefix = 'key')

In [218]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [219]:
df_with_dummy = df[['data1']].join(dummies)

In [220]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [221]:
np.random.seed(12345)

In [222]:
values = np.random.rand(10)

In [223]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [224]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [225]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [230]:
val = 'a,b, gu ido'

In [231]:
val.split(',')

['a', 'b', ' gu ido']

In [232]:
pieces = [x.strip() for x in val.split(',')]

In [233]:
pieces

['a', 'b', 'gu ido']

In [234]:
import re

In [238]:
text = "foo    bar\t baz  \tqux"

In [239]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

# 第八章 数据规整：聚合、合并和重塑

In [241]:
data = pd.Series(np.random.randn(9),
                index = [['a', 'a', 'a', 'b', 'b', 'c', 'c','d', 'd'],
                         [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [242]:
data

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [243]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [244]:
data['b']

1    0.228913
3    1.352917
dtype: float64

In [245]:
data['b':'c']

b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
dtype: float64

In [247]:
data.loc[['b','d']]

b  1    0.228913
   3    1.352917
d  2   -0.371843
   3    1.669025
dtype: float64

In [248]:
data.loc[:,2]

a   -1.296221
c   -2.001637
d   -0.371843
dtype: float64

In [249]:
data.unstack()

          1         2         3
a  1.007189 -1.296221  0.274992
b  0.228913       NaN  1.352917
c  0.886429 -2.001637       NaN
d       NaN -0.371843  1.669025

In [250]:
data.unstack().stack()

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [265]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1,2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
         ['Green', 'Red', 'Green']])

In [266]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [267]:
frame.index.names = ['key1','key2']

In [269]:
frame.columns.names = ['state','color']

In [270]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [272]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [273]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [274]:
frame.sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [275]:
frame.swaplevel(0,1).sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [276]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [277]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [280]:
frame.sum(level='color',axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [281]:
frame = pd.DataFrame({'a': range(7), 
                      'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two','two','two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})

In [282]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [283]:
frame2 = frame.set_index(['c','d'])

In [284]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [285]:
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [286]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [288]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a',
'b'],
                  'data1': range(7)})

In [289]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                        'data2': range(3)})

In [291]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [292]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [293]:
import pandas as pd

In [294]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0